src/cf/Catalogs/МестаХраненияДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>МестаХраненияДел</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноРазмещатьНовыеДела</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриторияПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииИПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СведенияОПомещениях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПомещениях</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СодержитМестаХранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииИПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/МестаХраненияДел/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСхемыПомещений") Тогда
		Если Не Ссылка.Пустая() Тогда 
			ПредыдущееПомещение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ТерриторияПомещение");
			
			Если ТерриторияПомещение <> ПредыдущееПомещение Тогда 
				УбратьСведенияОПомещении(ПредыдущееПомещение, Ссылка);
			КонецЕсли;
		КонецЕсли;
		
		ТерриторияСодержитМестаХранения(ТерриторияПомещение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда 
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура УбратьСведенияОПомещении(Территория, МестоХранения)  
	
	Если Не ЗначениеЗаполнено(Территория) Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МестаХраненияДел.Ссылка
		|ИЗ
		|	Справочник.МестаХраненияДел КАК МестаХраненияДел
		|ГДЕ
		|	МестаХраненияДел.ТерриторияПомещение В ИЕРАРХИИ(&Территория)
		|	И МестаХраненияДел.Ссылка <> &МестоХранения";
	Запрос.УстановитьПараметр("Территория", Территория);
	Запрос.УстановитьПараметр("МестоХранения", МестоХранения);
	
	Выборка = Запрос.Выполнить();
	
	Запись = РегистрыСведений.СведенияОПомещениях.СоздатьМенеджерЗаписи();
	Запись.Объект = Территория;
	Запись.Прочитать();
	
	СодержитМестаХранения = Не Выборка.Пустой();
	
	Если СодержитМестаХранения <> Запись.СодержитМестаХранения Тогда 
		Запись.Объект = Территория;
		Запись.СодержитМестаХранения = Не Выборка.Пустой();
		Запись.Записать(Истина);
		
		РодительскаяТерритория = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Территория, "Родитель");
		Если ЗначениеЗаполнено(РодительскаяТерритория) Тогда 
			УбратьСведенияОПомещении(РодительскаяТерритория, МестоХранения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ТерриторияСодержитМестаХранения(Территория)  
	
	Если Не ЗначениеЗаполнено(Территория) Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.СведенияОПомещениях.СоздатьМенеджерЗаписи();
	Запись.Объект = Территория;
	Запись.Прочитать();
	
	Если Не Запись.СодержитМестаХранения Тогда 
		Запись.Объект = Территория;
		Запись.СодержитМестаХранения = Истина;
		Запись.Записать(Истина);
		
		РодительскаяТерритория = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Территория, "Родитель");
		Если ЗначениеЗаполнено(РодительскаяТерритория) Тогда 
			ТерриторияСодержитМестаХранения(РодительскаяТерритория);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
